# SetDescription Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..SetDescription Method
FamilyManager Class See Also
---
Set the description for an existing family parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetDescription(
	FamilyParameter familyParameter,
	string description
)
```

Visual Basic
---
```text
Public Sub SetDescription ( _
	familyParameter As FamilyParameter, _
	description As String _
)
```

Visual C++
---
```text
public:
void SetDescription(
	FamilyParameter^ familyParameter,
	String^ description
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameterThe family parameter.
description
    Type: System..::..StringThe description of the family parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"familyParameter"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |

# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace